export default function discord() {
  return (
    <section className="bg-gradient-to-b from-gray-100 to-white">
      <div className="max-w-6xl mx-auto px-4 sm:px-6">
        <div className="pt-32 pb-12 md:pt-40 md:pb-20">

          {/* Page header */}
          <div className="max-w-3xl mx-auto text-center pb-12 md:pb-20">
            <h1 className="h1">이용약관 · 개인정보 이용 동의서</h1>
            <h3 className="h3">모든 것들을 확인하고 동의할 시에만 사용 가능합니다.</h3>
            <h3 className="h3">ﾠﾠ</h3>
            <h4 className="h4">1. 이용약관</h4>
            <h5 className="h5">1-1. 발로봇 애플리케이션과 웹사이트 등 발로봇에 관련된 모든 것들을 이하 '서비스'라 칭하고<br></br>서비스를 이용하는 모두를 '사용자'라고 칭한다.<br></br>또한 서비스를 제공하는 개발진을 '서비스 제공자'라고 칭한다.</h5>
            <h5 className="h5">1-2. 사용자는 서비스를 이용하기 위해서는 반드시 이용약관(TOS)와 개인정보 이용 동의서(PP)를 모두 확인하고 동의해야만 하고, 만일 미확인하거나 동의하지 않을 시 일어나는 모든 일들의 책임은 사용자가 모두 져야 합니다.</h5>
            <h5 className="h5">1-3. 사용자가 서비스를 이용하는 중에 사용자 본인의 부주의로 일어나는 모든 일의 책임은 사용자 본인에게 모두 있으며, 서비스 제공자는 그 어떤 것도 책임지고 배상하지 않습니다.</h5>
            <h3 className="h3">ﾠﾠ</h3>
            <h4 className="h4">2. 서비스의 보호</h4>
            <h5 className="h5">2-1. 사용자는 서버스를 이용하면서 서비스 측에 그 어떠한 피해를 주지 않아야 하고<br></br>서비스에게 피해를 조금이라도 주었을 시 모두 본인이 책임지고 변상해야 합니다.</h5>
            <h5 className="h5">2-2. '피해'의 종류에는 서비스 해킹, 디스코드 / 호스팅 서버 테러, 봇에게 직접 테러 등이 있습니다.</h5>
            <h3 className="h3">ﾠﾠ</h3>
            <h4 className="h4">3. 수집하는 개인정보</h4>
            <h5 className="h5">3-1. 서비스는 사용자에게서 사용자에 대한 개인정보를 수집하고, 수집한 개인정보들을 사용할 수 있습니다.</h5>
            <h5 className="h5">3-2. 서비스는 <strong>일시적으로 '사용자의 라이엇 ID와 비밀번호', '사용자의 디스코드 프로필 사진',<br></br>'사용자의 디스코드 닉네임'</strong>을 수집하고 사용한 뒤 그 뒤에 곧바로 영구적으로 폐기합니다.</h5>
            <h5 className="h5">3-3. 서비스는 <strong>'사용자의 라이엇 Auth토큰과 Ent토큰, 쿠키', '사용자의 디스코드 ID(int)'<br></br>'사용자의 언어', '사용자의 발로란트 서버 지역', '사용자의 디스코드 서버 이름'</strong>을 수집하고 DB에 저장하고,<br></br>사용자의 요청이 있을 시 언제든지 DB으로부터 그 정보를 불러와 사용합니다.</h5>
            <h3 className="h3">ﾠﾠ</h3>
            <h4 className="h4">4. 개인정보의 파기와 보안</h4>
            <h5 className="h5">4-1. 사용자가 개인정보 파기를 원할 시, 앱 내에서 <strong>/로그아웃</strong> 명령어를 사용해 데이터베이스에서 자신의 모든 개인정보들을 영구적으로 삭제할 수 있으며, 이에 대한 불이익은 없고,<br></br>다시 /로그인 명령어를 사용할시 데이터베이스에 새롭게 업데이트되어 저장됩니다.</h5>
            <h5 className="h5">4-2. 서비스 제공자의 잘못으로 인해 사용자의 개인정보가 제3자에게 유출/판매 되었을 때에는 서비스 제공자가 모든 책임을 다 지고 모두에게 합당한 보상을 해주어야 합니다.</h5>
            <h5 className="h5">4-3. 하지만 만약 사용자 본인의 잘못으로 인해 개인정보가 제3자에게 유출/판매 되었을 시에는 사용자가 모든 책임을 지고, 서비스 제공자는 그 어떤 책임도 지지 않으며, 사용자에게 그 어떤 것도 변상할 의무가 없습니다.</h5>
            <h3 className="h3">ﾠﾠ</h3>
            <h4 className="h4">5. TOS와 PP</h4>
            <h5 className="h5">5-1. 위 이용약관과 개인정보 이용 동의서에 동의하지 않을 시, 서비스의 사용이 불가능합니다.</h5>
            <h5 className="h5">Tos and Pp v.2.0 | 23.08.02</h5>
          </div>

          {/* Form */}
          

        </div>
      </div>
    </section>
  )
}

